hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/uart.h
//###########################################################################
//
// FILE:   uart.h
//
// TITLE:  CM UARTdriver.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright: $
//###########################################################################

#ifndef UART_H
#define UART_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup uart_api UART
//! \brief The UART module is used for UART configurations.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc_cm/hw_memmap.h"
#include "inc_cm/hw_types.h"
#include "inc_cm/hw_uart.h"
#include "debug.h"
#include "interrupt.h"

//*****************************************************************************
//
// Defines for the API.
//
//*****************************************************************************

//*****************************************************************************
//
// Values that can be passed to UART_enableInterrupt,
// UART_disableInterrupt, and UART_clearInterruptStatus
// as the intFlags parameter, and returned from UART_getInterruptStatus.
//
//*****************************************************************************
#define UART_INT_DMATX          0x20000U     //!<DMA TX interrupt
#define UART_INT_DMARX          0x10000U     //!< DMA RX interrupt
#define UART_INT_9BIT           0x1000U      //!<9-bit address match interrupt
#define UART_INT_EOT            0x800U       //!<Receive Interrupt Mask
#define UART_INT_OE             0x400U       //!<Overrun Error Interrupt Mask
#define UART_INT_BE             0x200U       //!<Break Error Interrupt Mask
#define UART_INT_PE             0x100U       //!<Parity Error Interrupt Mask
#define UART_INT_FE             0x080U       //!<Framing Error Interrupt Mask
#define UART_INT_RT             0x040U       //!<Receive Timeout Interrupt Mask
#define UART_INT_TX             0x020U       //!<Transmit Interrupt Mask
#define UART_INT_RX             0x010U       //!<Receive Interrupt Mask

//*****************************************************************************
//
// Values that can be passed to UART_setConfig as the config parameter
// and returned by UART_getConfig in the config parameter.
// Additionally, the UART_CONFIG_PAR_* subset can be passed to
// UART_setParityMode as the parity parameter, and are returned by
// UART_getParityMode.
//
//*****************************************************************************
#define UART_CONFIG_WLEN_MASK   0x00000060U  //!<Mask for extracting wordlength
#define UART_CONFIG_WLEN_8      0x00000060U  //!< 8 bit data
#define UART_CONFIG_WLEN_7      0x00000040U  //!< 7 bit data
#define UART_CONFIG_WLEN_6      0x00000020U  //!< 6 bit data
#define UART_CONFIG_WLEN_5      0x00000000U  //!< 5 bit data
#define UART_CONFIG_STOP_MASK   0x00000008U  //!< Mask for extracting stop bits
#define UART_CONFIG_STOP_ONE    0x00000000U  //!< One stop bit
#define UART_CONFIG_STOP_TWO    0x00000008U  //!< Two stop bits
#define UART_CONFIG_PAR_MASK    0x00000086U  //!< Mask for extracting parity
#define UART_CONFIG_PAR_NONE    0x00000000U  //!< No parity
#define UART_CONFIG_PAR_EVEN    0x00000006U  //!< Even parity
#define UART_CONFIG_PAR_ODD     0x00000002U  //!< Odd parity
#define UART_CONFIG_PAR_ONE     0x00000082U  //!< Parity bit is one
#define UART_CONFIG_PAR_ZERO    0x00000086U  //!< Parity bit is zero

//*****************************************************************************
//
// Values that can be passed to UART_setFIFOLevel as the txLevel parameter
// and returned by UART_getFIFOLevel in the txLevel.
// These are 8 bit ( 1 byte) wide and 16 locations deep FIFOs.
// Eg. To get a transmit interrupt after 4 data bytes are transmitted we need 
// a trigger after the transmit FIFO has 4 bytes with 4 locations deep
// ie.4 out of 16 locations deep which is 1/4 full.(UART_FIFO_TX2_8)
//
//*****************************************************************************
#define UART_FIFO_TX1_8      0x00000000U  //!< Transmit interrupt at 1/8 Full
#define UART_FIFO_TX2_8      0x00000001U  //!< Transmit interrupt at 1/4 Full
#define UART_FIFO_TX4_8      0x00000002U  //!< Transmit interrupt at 1/2 Full
#define UART_FIFO_TX6_8      0x00000003U  //!< Transmit interrupt at 3/4 Full
#define UART_FIFO_TX7_8      0x00000004U  //!< Transmit interrupt at 7/8 Full

//*****************************************************************************
//
// Values that can be passed to UART_setFIFOLevel as the rxLevel parameter
// and returned by UART_getFIFOLevel in the rxLevel.
// These are 8 bit ( 1 byte) wide and 16 locations deep FIFOs.
// Eg. To get a receive interrupt after 4 data bytes are received, we need 
// a trigger after the receive FIFO has 4 bytes with 4 locations deep
// ie.4 out of 16 locations deep which is 1/4 full.(UART_FIFO_RX2_8)
//
//*****************************************************************************
#define UART_FIFO_RX1_8         0x00000000U  //!< Receive interrupt at 1/8 Full
#define UART_FIFO_RX2_8         0x00000008U  //!< Receive interrupt at 1/4 Full
#define UART_FIFO_RX4_8         0x00000010U  //!< Receive interrupt at 1/2 Full
#define UART_FIFO_RX6_8         0x00000018U  //!< Receive interrupt at 3/4 Full
#define UART_FIFO_RX7_8         0x00000020U  //!< Receive interrupt at 7/8 Full

//*****************************************************************************
//
// Values that can be passed to UART_enableDMA() and UART_disableDMA().
//
//*****************************************************************************
#define UART_DMA_ERR_RXSTOP   0x00000004U  //!< Stop DMA receive if UART error
#define UART_DMA_TX           0x00000002U  //!< Enable DMA for transmit
#define UART_DMA_RX           0x00000001U  //!< Enable DMA for receive

//*****************************************************************************
//
// Values returned from UART_getRxError().
//
//*****************************************************************************
#define UART_RXERROR_OVERRUN    0x00000008U
#define UART_RXERROR_BREAK      0x00000004U
#define UART_RXERROR_PARITY     0x00000002U
#define UART_RXERROR_FRAMING    0x00000001U

//*****************************************************************************
//
// Values that can be passed to UART_setTxIntMode() or returned from
// UART_getTxIntMode().
//
//*****************************************************************************
#define UART_TXINT_MODE_FIFO    0x00000000U  //!< trigger based on tx FIFOlevel
#define UART_TXINT_MODE_EOT     0x00000010U  //!< trigger when transmitter idle

//*****************************************************************************
//
// The system clock divider defining the maximum baud rate supported by the
// UART.
//
//*****************************************************************************
#define UART_CLK_DIVIDER        8U

//*****************************************************************************
//
// UART clock frequency in HZ .
// Value that can be passed to UART_setConfig() & UART_getConfig().
//
//*****************************************************************************
#define UART_CLK_FREQ        CM_CLK_FREQ  //!< CPU frequency

//Mask for all errors
#define UART_RSR_ALL_M  (UART_RSR_BE | UART_RSR_FE | UART_RSR_OE | UART_RSR_PE)

//*****************************************************************************
//
//SIR ( IrDA ) Low Power Baud macro . IrLPBaud16 is nominally 1.8432 MHz.
// Value that can be passed to  UART_setIrDALPDivisor(). 
//
//*****************************************************************************
#define UART_CLK_IRLPBAUD16       1843200U  

//*****************************************************************************
//
// UART interrupt type.Values that can be passed to UART_getInterruptStatus() 
//
//*****************************************************************************

